//Од стандарден влез да се вчита број N и потоа да се вчитаат N елементи во една низа.
//Внесената низа да се трансформира на начин што за секој втор елемент во низата, да му се додаде неговиот претходен лев сосед.
//Трансформираната низа да се испечати на стандарден излез, така што елементите ќе се одвоени со празно место меѓу нив.
//input                              output
//5                                  1 3 3 7 5
//1 2 3 4 5

//input                              output
//10                                 8 58 74 133 31 104 45 124 24 34
//8 50 74 59 31 73 45 79 24 10

//input                                            output
//15                                               72 129 4 93 74 157 98 172 63 150 99 148 21 84 88
//72 57 4 89 74 83 98 74 63 87 99 49 21 63 88

#include <iostream>
using namespace std;

void pecatiNiza(int a[], int n){
    for(int i=0; i<n; i++){
        if (i%2!=0){
            a[i]+=a[i-1];
        }
    }
    for(int i=0; i<n; i++){
        cout<<a[i]<< " ";
    }
}

int main() {
    int N, a[100];
    cin>>N;
    for(int i=0; i<N; i++){
        cin>>a[i];
    }
    pecatiNiza(a,N);

    return 0;
}
