//Од стандарден влез да се вчита број N и потоа се вчитуваат N елементи во една низа.
//Внесената низа да се трансформира на начин што елементите кои се наоѓаат на парни позиции ќе се помножат со 2,
//а елементите кои се на непарни позиции ќе се зголемат за 2. Трансформираната низа да се испечати.

//input                    output
//5                        2 4 6 6 10
//1 2 3 4 5

#include <iostream>

using namespace std;

void pecatiNiza(int a[], int n){
    for (int i=0; i<n; i++){
        if (i%2==0){
            a[i]*=2;
        }
        else if (i%2!=0){
            a[i]+=2;
        }
    }
    for (int i=0; i<n; i++){
        cout<<a[i]<<" ";
    }
}

int main() {
    int N, a[100];
    cin >> N;
    for (int i = 0; i < N; i++) {
        cin >> a[i];
    }
    pecatiNiza(a, N);

    return 0;
}
