//Од стандарден влез се вчитува цел број n кој ја претставува должината на една низа,
//а потоа се внесуваат елементите на истата и на крај број k. Да се напише програма која
//ја трансформира низата, такашто ќе се направи замена на местата помеѓу елементот на позиција k
//и неговиот претходник. Имајте во предвид дека промената треба да се направи кога низата
//ја читаме од лево кон десно И исто така во спротивен правец, од десно кон лево.

//input                 output
//8                     1 3 2 4 5 7 6 8
//1 2 3 4 5 6 7 8
//2

#include<iostream>

using namespace std;

int main() {
    int n, a[100], k;
    cin >> n;
    for (int i=0; i < n; i++){
       cin>>a[i];
    }
    cin>>k;

    int k1=n-k; //za odnazad

    for (int i=0; i < n; i++){
        if (i==k){
            int temp=a[i];
            a[i]=a[i-1];
            a[i-1]=temp;
        }
        if (i==k1){
            int temp=a[i];
            a[i]=a[i-1];
            a[i-1]=temp;
        }
    }

    for (int i=0; i < n; i++){
        cout<<a[i]<<" ";

    }
    return 0;
}
