//Од стандарден влез се вчитува цел број N. Потоа се внесува низа од N цели броеви.
//Напиши програма која ќе ги трансформира елементите на низата на следниот начин:
//Секој парен елемент, зголеми го за 3, а секој непарен елемент кој е деллив со 5, одземи го за 2.
//На крај, испечати ја трансформираната низа

//input                 output
//7                     3 15 17 13 3 3 9
//5 12 14 15 3 5 9

#include<iostream>

using namespace std;

int main() {
    int N, a[100];
    cin>>N;
    for (int i=0; i<N; i++){
       cin>>a[i];
    }
    for (int i=0; i<N; i++){
        if (a[i]%2==0){
            a[i]+=3;
        }
        else if (a[i]%2!=0 && a[i]%5==0){
            a[i]-=2;
        }
    }
    for (int i=0; i<N; i++){
        cout<<a[i]<<" ";

    }
    return 0;
}
