//Дадени се еден четирицифрен и еден трицифрен број.
//Да се пресмета аритметичка средина на броевите кои се наоѓаат на парните позиции на трицифрениот број и на непарните позиции на четирицифрениот број
//Напомена: Под парни позиции се смета и нулта позиција
//пр. за бројот 2468 на нулта позиција е 2, на прва е 4, на втора е 6, на трета е 8.
// input:           output:
// 123              4
// 4567

#include <iostream>
using namespace std;
int main() {
    int n3, n4, c0, c2, c1, c3;
    float as;
    cin >> n3 >> n4;
    c0 = n3 / 100;
    c2 = n3 % 10;
    c1 = n4 /100 % 10;
    c3 = n4 % 10;
    as = ( c0 + c2 + c1 + c3 ) / 4.0;
    cout << as;

    return 0;
}
