//Да се напише програма што за внесен број на поени од испит ќе генерира соодветна оценка според следната табела:
// 0-50   5ka
// 51-60  6ka
// 61-70  7ka
// 71-80  8ka
// 81-90  9ka
// 91-100 10ka
//Да се промени претходната програма, така што покрај оценките ќе се испечатат и знаците + и – во зависност од вредноста на последната цифра на поените:
// последна цифра 1-3 ( печати - )
// последна цифра 4-7 ( не печати ништо )
// последна цифра 8-0 ( печати + )
//За оценката 5 не треба да се додава + и -, а за оценката 10 не треба да се додава +
#include <iostream>
using namespace std;
int main() {
    int poeni, ocenka, c;
    cin >> poeni;
    c = poeni % 10;
    if ( poeni >= 0 && poeni <=100 ){
        if ( poeni <= 50 ){
            cout << "5";
            return 0;
        }
        else if ( poeni <= 60 ){
            cout << "6";
        }
        else if ( poeni <= 70 ){
            cout << "7";
        }
        else if ( poeni <= 80 ){
            cout << "8";
        }
        else if ( poeni <= 90 ){
            cout << "9";
        }
        else {
            cout << "10";
        }

    }
    if ( poeni >= 51 && poeni <= 100 ){
        if ( c == 1 || c == 2 || c == 3 ){
            cout << "-" << endl;
        }
        else if ( c == 8 || c == 9 || c==10 ){
            cout << "+" << endl;
        }

    }
    return 0;
}
