//Да се напише програма која за петцифрен број внесен од стандарден влез ќе го „искастри“.
//Еден број е искастрен ако неговата најлева и најдесна цифра се избришани.
//На излез да се испачатат искастрениот број и во нов ред збирот на цифрите кои се кастрат.
//Појаснување: Бројот 54321 искастрен е 432. Цифрите кои се кастрат се 5 и 1.
// input:           output:
// 54321            432
//                  6

#include <iostream>
using namespace std;
int main() {
    int n, n0, n4, sum = 0;
    cin >> n;
    n0 = n % 10;
    n = n / 10;
    n4 = n / 1000;
    n = n % 1000;
    sum = n0 + n4;
    cout << n << endl;
    cout << sum;


    return 0;
}
