//Да се провери дали одреден внесен 6цифрен број е симетричен.
//Тоа значи првата цифра од бројот да е еднаква со последната, втората со петтата...
//Пример за симетрични броеви: 123321, 805508

//input          output
//103301         1

#include <iostream>
using namespace std;
int main() {

    int n, c1, c2, c3, c4, c5, c6, pecati;
    cin >> n;
    c6 = n % 10;
    c5 = n / 10 % 10;
    c4 = n / 100 % 10;
    c3 = n / 1000 % 10;
    c2 = n / 10000 % 10;
    c1 = n / 100000;
    pecati = ( c1 == c6 && c2 == c5 && c3 == c4 );
    cout << pecati;



    return 0;
}
