//Да се напише програма за калкулатор за цена на билети за кино. Цената на билетот зависи од категоријата на филмот и возраста на купувачот.
//Пресметките за цена на билет се следни:
//За филмови кои спаѓаат во категорија 1, цената на билетот е 8 долари за сите возрасти.
//За филмови кои спаѓаат во категорија 2, цената на билетот е 8 долари за клиенти под 12 години и 12 долари за корисници на 12 години и постари.
//За филмови кои спаѓаат во категорија 3, цената на билетот е 10 долари за клиенти помлади од 12 години и 15 долари за клиенти од 12 години и постари.
//За филмови кои спаѓаат во категорија 4, цената на билетот е 15 долари за клиенти под 17 години и 18 долари за корисници на 17 години и постари.
//Од стандарден влез се читаат категорија на филмот и возраст на купувачот. Да се испечати цената на билетот.

//input                output
//1 10                 Price: 8$
//2 8                  Price: 8$

#include <iostream>
using namespace std;
int main() {
    int kategorija, vozrast, cena;
    cin >> kategorija >> vozrast;
    if ( kategorija == 1 ){
        cena = 8;
    }
    else if ( kategorija == 2 ){
        if ( vozrast < 12 ){
            cena = 8;
        }
        else if ( vozrast >= 12 ){
            cena = 12;
        }

    }
    else if ( kategorija == 3 ){
        if ( vozrast < 12 ){
            cena = 10;
        }
        else if ( vozrast >= 12 ){
            cena = 15;
        }

    }
    else if ( kategorija == 4 ){
        if ( vozrast < 17 ){
            cena = 15;
        }
        else if ( vozrast >= 17 ){
            cena = 18;
        }

    }

    cout << "Price: " << cena <<"$";



    return 0;
}
