/* Во играта Бинго по редослед се извлекуваат непознат број броеви со вредности помеѓу 1 и 90.
Секогаш се извлекуваат повеќе од 8 броја, додека внесувањето престанува кога ќе се внесе број кој не е во опсегот вредности.
Освен главната добивка, играчите играат и на џокер број, џокер бројот се формира на следниот начин:
Се слепуваат помалку значајните цифри од првите 7 извлечени броја,
и на тој број се додаваат сите следни внесени броеви (не треба да се додаде последниот внесен што е надвор од опсегот).
Ваша задача е да го отпечатите така добиениот џокер број.
Објаснување за тест примерот:
Внесените броеви се
2 32 45 78 64 21 7 65 18 32 88 1 99
Помалку значајните цифри од првите седум броеви залепени го даваат бројот  2258417 на овој број се додава збирот од преостанатите, и се добива 2258621


input                                      output
2 32 45 78 64 21 7 65 18 32 88 1 99        2258621
56 13 87 89 55 47 65 1 10 20 99            6379606
 */

#include <iostream>
using namespace std;
int main(){
    int n, joker = 0;
    for ( int i = 1; i <= 7; i++ ){
        cin >> n;
        joker = joker * 10 + n%10;
    }
    while ( cin >> n ){
        if ( n < 1 || n > 90){
            break;
        }
        else{
            joker = joker + n;
        }

    }
    cout << joker;

    return 0;
}
