/* Александар пробува да комуницира со вас преку шифрирани пораки. Тој ни ги дава следните инструкции за како да ги дешифрираме за да се читливи бројките што сака да ни ги испрати:
За даден број внесен на стандарден влез да се преврти истиот во обратен редослед. При тоа, се внесува и карактер x за кој треба сите цифри на парните позиции на бројот да се заменат со тој карактер.
Да се испечати превртениот број со карактерот на парните позиции.
Напомена: најдесната цифра се зима како 0-та цифра.
Пример: бројот 12345 цифрите на парните позиции му се 5, 3 и 1; а превртен е 54321. 

input         output
-             -0-0-7-
3710307

*/


#include <iostream>
using namespace std;
int main() {
    char c;
    int n;
    cin >> c;
    cin >> n;
    for ( int i = 0; n > 0 ; i++, n /= 10){
        if ( i % 2 == 0 ) {
            cout << c;
        }
        else {
            cout << n % 10;
        }
    }

    return 0;
}
