//Сакаме да ги истражиме цените на одредени производи во продавница и да видиме кој од нив се над просечната цена,
//а кои под просечната цена. За да го постигнеме ова, влезот е N, бројот на производите, а потоа N производи,
//претставувајќи ја нивната цена. Вашата задача е да го пресметате просекот на сите производи, а потоа да ги замените
//оние кои се под просекот со вреднот 0, и оние над просекот ИЛИ ЕДНАКВИ, со 1.
//На излез испечатете ја просечната цена, како и трансформираната низа.

//input                    output
//5                        Average price: 200
//100 150 200 250 300      0 0 1 1 1

#include <iostream>
#include<iomanip>

using namespace std;

int main() {
    int n, a[100], vkupno=0, suma=0;
    float prosek;
    cin>>n;
    for (int i=0; i<n; i++){
        cin>>a[i];
        suma+=a[i];
        vkupno++;
    }
    prosek=(float)suma/vkupno;
    cout<<"Average price: "<<prosek<<endl;
    for (int i=0; i<n; i++){
        if (a[i]<prosek){
            a[i]=0;
        }
        else if (a[i]>=prosek){
            a[i]=1;
        }
        cout<<a[i]<<" ";
    }

    return 0;
}
