//Од стандарден влез се чита цел број N. Потоа се вчитуваат N низи од цели броеви (со максимална должина од 100 елементи)
//при што за секоја прво се внесува должината на низата, а потоа сите елементи во низата.
//Да се напише програма која за секоја низа ќе го испечати ПРОЦЕНТОТ на огледални еднакви броеви во низата.
//Огледални броеви во низа се првиот и последниот, вториот и претпоследниот итн. 
//Доколку низата има непарен број на елементи, средниот елемент е и огледален и еднаков.

//input                 output         (2,5,5 се огледални и еднакви за првата)
//3                     60.00%         (1,1,3,3 за втората и 8,8,4,4 за третата)
//5 7 2 5 2 8           66.67%
//6 1 2 3 3 1 1         50.00%
//8 8 4 8 3 2 1 4 8

#include <iostream>
#include<iomanip>

using namespace std;

int main() {
    int n, a[100];
    cin>>n;
    for (int i=0; i<n; i++){
        int m;
        cin>>m;
        int vkupno=0;
        int br=0;
        for (int i=0; i<m; i++) {
            cin >> a[i];
            vkupno++;
        }
        if (vkupno%2!=0){
            br++;
        }
        for (int i=0, n=m-1; i<n; i++, n--) {
            if (a[i]==a[n]){
                br+=2;
            }
        }
        float procent=100/(float)vkupno*br;
        cout<<(fixed)<<setprecision(2)<<procent<<"%"<<endl;
    }

    return 0;
}
