//Од стандарден влез да се вчита број N и потоа да се вчитаат N низи од цели броеви,
//при што за секој прво се внесува должината на низата, а потоа сите елементи на низата и на крај бројот К.
//Да сe напише програма која за секоја низа ќе ја трансформира истата такашто секој К-ти елемент
//прво ќе го помножи со неговиот реден број во низата, потоа ќе го одземе неговиот следбеник.
//Доколку К-тиот елемент нема следбеник, се собира неговиот претходник.
//Пр. 1 2 3 4 5 6 7 8 за К=2 се добива  1 1 3 11 5 29 7 71. Да се испечатат сите трансформирани низи.

//input                         output                            input                  output
// 5                            1 2 5 4                           3                      1 1 3 19
// 4                            1 1 3 11 5                        4                      -1 1 5 11 36
// 1 2 3 4                      1 6 7 11 1 6 8 24                 1 2 3 4                1 5 6 7
// 3                            1 7 3 16 8 126 12 512 8           2
// 5                            1 5 43 6 34 6 4 2 23 606 44       5
// 1 2 3 4 5                                                      1 2 3 4 5
// 2                                                              1
// 8                                                              4
// 1 6 7 3 1 6 8 2                                                1 5 6 7
// 4                                                              5
// 9
// 1 5 3 6 8 23 12 65 8
// 2
// 11
// 1 5 43 6 8 6 4 2 23 65 44
// 5

#include <iostream>
#include <cmath>
using namespace std;

void transformirajNiza (int a[], int n, int k){
    for (int i=k-1, m=k; i<=n; i+=k, m+=k){
        if (m==n){
            a[i]=(a[i]*m)+a[i-1];
        }
        else{
            a[i]=(a[i]*m)-a[i+1];
        }
    }
}

int main(){
    int N,n, a[100], k;
    cin>>N;
    while (N!=0){

        cin>>n;
        for (int i=0; i<n; i++){
            cin>>a[i];
        }
        cin>>k;

        transformirajNiza(a,n,k);

        for (int i=0; i<n; i++){
            cout<<a[i]<<" ";
        }
        cout<<endl;

        N--;
    }

    return 0;
}
