//Да се внесе петоцифрен број и да се провери дали збирот на првата и третата цифра е поголем од збирот на останатите цифри.
//Доколку збирот на првата и третата цифра е поголем да се отпечати 1, во спротивно да се отпечати 0.
//Напомена: прва цифра се гледа од десно, односно цифрата на единици.
//Пр: влез: 12345 Излез: 1

#include <iostream>
using namespace std;
int main() {
    int n, e, d, s, i, di, zbir;
    cin >> n;
    e = n % 10;
    d = n / 10 % 10;
    s = n / 100 % 10;
    i = n / 1000 % 10;
    di = n / 10000;
    zbir = ( ( e + s ) > ( d + i + di ) );
    cout << zbir;
    return 0;
}

