//Од стандарден влез се вчитува квадратна матрица со n редици и колони. Прво се вчитува бројот n, па n елементите на матрицата.
//Ако n е непарен број да се испечати порака GRESKA и да заврши програмата.
//Потребно е матрицата да се здипли. При диплењето се собираат елементите на позициите што се поклопуваат со диплењето.

//input                                                   output
// 4
// 1 2 3 4                     
// 5 6 7 8        ------>      14 16 18 20      ------>    34 34
// 9 10 11 12                  14 16 18 20                 34 34
// 13 14 15 16

#include <iostream>
using namespace std;
int main(){
    int a[100][100], n;
    cin>>n;
    if (n%2!=0){
        cout<<"GRESKA"<<endl;
    }
        for (int i=0; i<n; i++){
            for (int j=0; j<n; j++){
                cin>>a[i][j];
            }
        }

        for (int i=0; i<n/2; i++){
            for (int j=0; j<n; j++){
                a[i][j]+=a[n-i-1][j];
            }
        }

        for (int i=0; i<n/2; i++){
            for (int j=0; j<n/2; j++){
                a[i][j]+=a[i][n-j-1];
            }
        }

        for (int i=0; i<n/2; i++){
            for (int j=0; j<n/2; j++){
                cout<<a[i][j]<<" ";
            }
            cout<<endl;
        }


    return 0;
}
