//Од стандарден влез се внесува цел број n - димензии на квадратна матрица. Потоа се внесува матрицата.
//Да се трансформира матрицата такашто секој елемент кој се наоѓа во исто време под главната и споредната дијагонала во обратен број.
//Обратен број на некој број е ако тој е позитивен да се претвори во негативен, а ако е негативен во позитивен.

#include <iostream>
using namespace std;

int main(){
    int a[100][100], n;
    cin>>n;

    for (int i=0; i<n; i++){
        for (int j=0; j<n; j++){
            cin>>a[i][j];
        }
    }

    for (int i=0; i<n; i++){
        for (int j=0; j<n; j++){
            if(i>j && (i+j>n-1)){
                a[i][j]*=-1;
            }
        }
    }

    for (int i=0; i<n; i++){
        for (int j=0; j<n; j++){
            cout<<a[i][j]<<" ";
        }
        cout<<endl;
    }

    return 0;
}
