//На стандарден влез се читаат два броја a и b.
//Ваша задача е да ја најдете најголемата непарна цифра на секој број во опсег [a,b].
//Функцијата за наоѓање на најголема непарна цифра мора да е рекурзивна.
//Напомена: ако бројот нема непарни цифри се печати 0.
//Печатење на секој број и негова цифра е во формат: број -> цифра

// input         output
// 0 20          0 -> 0
//               1 -> 1
//               2 -> 0
//               3 -> 3
//               4 -> 0
//               5 -> 5
//               6 -> 0
//               7 -> 7
//               8 -> 0
//               9 -> 9
//               10 -> 1
//               11 -> 1
//               12 -> 1
//               13 -> 3
//               14 -> 1
//               15 -> 5
//               16 -> 1
//               17 -> 7
//               18 -> 1
//               19 -> 9
//               20 -> 0

#include <iostream>
using namespace std;

int maxCifra (int n){
    int max, cifra;
    if (n==0)
        return 0;
    else {
        max = n%10;
        cifra = maxCifra(n/10);
        if (max>cifra && max%2!=0){
            return max;
        }
        else{
            return cifra;
        }
    }
}

int main(){
   int a,b;
   cin>>a>>b;
   for (int i=a; i<=b; i++){
       cout << i << " -> " << maxCifra(i) << endl;
   }

    return 0;
}
