//Од тастатура се внесува одреден износ на пари кој корисник го има на својата трансакциска сметка
//Потоа, во нов ред се внесуваат 5 други износи одвоени со празно место.
//Тие претставуваат некаква трансакција - одреден трошок или добивка на пари.
//Програмата печати 1 доколку после извршените трансакции корисникот сеуште има пари на сметката, инаку печати 0.
//Пример: 25600 \n 10000 250 899 10 -45000   ------> 0


#include <iostream>
using namespace std;
int main() {
    int n, n1, n2, n3, n4, n5, pari;
    cin >> n;
    cin >> n1 >> n2 >> n3 >> n4 >> n5;
    pari = ( ( n + n1 + n2 + n3 + n4 + n5 ) > 0 );
    cout << pari;
    return 0;
}
