//Од стандарден влез се внесуваат следните податоци за еден студент на ФИНКИ
// *  индекс - 6-цифрен цел број
// *  шест оценки од последниот семестар кој го слушал
//Да се напише програма која на стандардниот излез ќе ги испечати следните информации за студентот
// -  просек на студентот (со точност од 3 децимали)
// -  година на студии (студентите чијшто индекс почнува на 17 се трета година, на 16 се четврта, на 15 се петта итн.)
// -  дали е награден (1=е награден, 0=не е награден (награден е ако има просек еднаков или поголем од 9.5))
// пример: 151021 9 9 10 10 10 8  --->  Prosek: 9.333 \n Student: 151021 \n 5 godina \n Nagraden: 0

#include <iostream>
using namespace std;
int main(){
    int indeks, o1, o2, o3, o4, o5, o6, godStudii, nagraden;
    cin >> indeks >> o1 >> o2 >> o3 >> o4 >> o5 >> o6;
    float prosek = ( o1 + o2 + o3 + o4 + o5 + o6 ) / 6.00f;
    godStudii = ( 2020 - ( indeks / 10000 ) ) % 10;
    nagraden = ( prosek >= 9.5 );
    cout << "Prosek: " << prosek << endl;
    cout << "Student: " << indeks << endl;
    cout << godStudii << " godina" << endl;
    cout << "Nagraden: " << nagraden;
    return 0;
}
