//Да се напише програма кадешто се внесува код, ценa на производ и сума која корисникот ја има.
//Последните 2 цифри од кодот означуваат колку % ддв треба да се наплати.
//Да се пресмета вкупната сума којашто корисникот треба да ја плати и да се испечати 1 ако има пари да ја плати сумата, ако не 0
//Да се реши со логички операции без if-else

#include <iostream>
using namespace std;
int main() {
    int kod, cena, suma;
    float ddv;
    cin >> kod >> cena >> suma;
    ddv = kod % 100;
    ddv = ( ddv / 100 ) + 1;
    cout << cena * ddv << endl;
    cout << ( suma >= cena * ddv );

    return 0;
}
