//Да се напише програма која од стандарден влез чита цел број(денови). На излез да се отпечати колку години, месеци и денови се тоа.
//Претпоставуваме дека сите месеци имаат 30 дена и секоја година има 365 дена.
// input:           output:
// 2535             Years: 6, months: 11, days: 15

#include <iostream>
using namespace std;
int main() {
    int d, m, y;
    cin >> d;
    y = d / 365;
    d = d % 365;
    m = d / 30;
    d = d % 30;
    cout << "Years: " << y << ", months: " << m << ", days: " << d;

    return 0;
}
