//Се внесува време во интернационална форма (4 вредности: час-од 1 до 12, минути - од 0 до 59, 
//секунди - од 0 до 59 и знак А ако е од полноќ д претпладне и Р ако е од пладне до полноќ)
//Да се презентира времето во македонска форма во која 0 часот стои наместо 12 на полноќ,
//од 13 до 23 часот стојат попладневните, од 1 до 11 претпладневните часови.
//input          output
//12 32 58 A     00:32:58
//12 0 0 P       12:00:00
//9 17 22 P      21:17:22
#include <iostream>
using namespace std;
int main()
{
    int h,m,s,hmk,mmk;
    char znak;
    cin>>h>>m>>s>>znak;
    if (h==12 && znak=='A')
    {
        hmk=0;
    }
    else if (h==12 && znak=='P')
    {
        hmk=12;
    }
    else if (h>=1&&h<=11&&znak=='A')
    {
        hmk=h;
    }
    else if (h>=1&&h<=11&&znak=='P')
    {

        hmk=h+12;
    }
    cout<<hmk;
    if (hmk==0) cout<<0;
    cout<<":"<<m;
    if (m==0) cout<<0;
    cout<<":"<<s;
    if (s==0) cout<<0;

    return 0;
}
