//Да се напише програма каде од стандарден влез се вчитува еден 5цифрен број.
//Програмата печати 1 доколку бројот е специјален, а 0 ако не е специјален.
//Еден број е специјален доколку за него важи дека е делив до збирот на својата втора и трета цифра,
//и првата, третата и петтата цифра се во растечки редослед.
//Да се внимава на делење со 0, т.е. да се испечати -1 во таков случај

//input          output
//12345          1

#include <iostream>
using namespace std;
int main() {

    int n, c1, c2, c3, c4, c5, sum23=0, pecati;
    cin >> n;
    c5 = n % 10;
    c4 = n / 10 % 10;
    c3 = n / 100 % 10;
    c2 = n / 1000 % 10;
    c1 = n / 10000;
    sum23 = c2 + c3;
    pecati = ( n % sum23 == 0 && c1<c3 && c3<c5 );
    cout << pecati << endl;
    if ( sum23 == 0 ){
        cout << "-1" << endl;
    }


    return 0;
}
